// Демонстрационные исходники. Это не код вашей конфигурации.
Процедура ВыполнитьОбмен(ДокументОбъект) Экспорт

    НачатьТранзакцию();
    Попытка
        ПроверитьДанные(ДокументОбъект);
        ДокументОбъект.Записать();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ЗаписатьЖурналРегистрации(ОписаниеОшибки());
        ВызватьИсключение;
    КонецПопытки;

КонецПроцедуры

Процедура ПроверитьДанные(ДокументОбъект)
    Если Не ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
        ВызватьИсключение "Не заполнена организация";
    КонецЕсли;
КонецПроцедуры
